import matplotlib.pyplot as plt
import numpy as np
x1 = (7.35, 14.7, 22.05, 29.4, 36.75, 44.1, 51.45, 58.8, 66.15, 73.5)
y1 = (0.364, 0.728, 1.092, 1.456, 1.82, 2.184, 2.548, 2.912, 3.276, 3.64)

x2 = (7.35, 14.7, 22.05, 29.4, 36.75, 44.1, 51.45, 58.8, 66.15, 73.5)
y2 = (7.35, 14.7, 22.05, 29.4, 36.75, 44.1, 51.45, 58.8, 66.15, 73.5)

# Построение графиков
plt.subplot(2, 1, 1)
plt.plot(x1, y1) # построение графика
plt.xlabel("Скорость, км/с", fontsize=14) # ось абсцисс
plt.ylabel("изменение температуры", fontsize=14) # ось ординат
plt.grid(True) # включение отображение сетки

plt.subplot(2, 1, 1)
plt.plot(x2, y2) # построение графика
plt.xlabel("Масса, кг * 10^14 и Скорость, км/с", fontsize=14) # ось абсцисс
plt.ylabel("изменение температуры", fontsize=14) # ось ординат
plt.grid(True) # включение отображение сетки

plt.show()